{
  "COMMON": {
    "PLAY": "Play",
    "RULES": "Rules",
    "LOGIN": "Login",
    "WELCOME": "Welcome",
    "COPY": "Copy",
    "COPY_SUCCESS": "Link copied to clipboard!",
    "SHARE_GAME": "Share this game",
    "SHARE_LINK": "Share this link with your opponent:"
  },
  "LOGIN": {
    "YOUR_NICKNAME": "Your Nickname:",
    "ENTER_NICKNAME": "Enter your nickname",
    "CHOOSE_TEAM": "Choose your team",
    "PLAY": "Play"
  },
  "GAME": {
    "YOUR_TURN": "It's your turn!",
    "WAITING": "Waiting...",
    "MOVE_PIECE": "Move a piece to continue.",
    "OPPONENT_TURN": "Turn of",
    "CONNECTING": "Connecting",
    "ROLE_DETERMINING": "Determining role in the game...",
    "WHITE_PLAYER": "White Player",
    "BLACK_PLAYER": "Black Player",
    "PIECES": "Pieces",
    "TURN": "Turn",
    "WAITING_STATUS": "Waiting",
    "RECENT_MOVES": "Recent Moves"
  },
  "MENU": {
    "SELECT_MODE": "Select Game Mode",
    "ONLINE": "Play Online",
    "LOCAL": "Play Locally",
    "VS_COMPUTER": "Play against Computer"
  },
  "GAME_OVER": {
    "TITLE": "Game Over!",
    "WINNER": "The winner is",
    "WHITE": "White",
    "BLACK": "Black",
    "NEW_GAME": "New Game"
  },
  "JOIN": {
    "JOIN_GAME": "Join Game",
    "NICKNAME": "Your nickname",
    "REQUIRED": "Required",
    "MIN_LENGTH": "Minimum 3 characters",
    "NEXT": "Next",
    "GAME_ID": "Game ID",
    "JOIN_AS": "Join as"
  },
  "CHAT": {
    "PLACEHOLDER": "Write a message...",
    "CHAT_TITLE": "Chat:"
  },
  "FOOTER": {
    "COPYRIGHT": "© {{year}} OnlineCheckers.org"
  },
  "RULES": {
    "TITLE": "Italian Checkers - Rules and How to Play",
    "INTRODUCTION": "Italian Checkers is a traditional variant of the game of checkers, played on an 8x8 board with 12 pieces per player. It is the official version regulated by the Italian Checkers Federation (FID) and played in tournaments in Italy.",
    "INTRO_TEXT": "With unique rules that distinguish it from other European variants, Italian Checkers has a long tradition in Italian culture.",
    "HISTORY_TITLE": "History of Italian Checkers",
    "HISTORY_TEXT_1": "Italian Checkers has a rich history that intertwines with Italian culture through the centuries.",
    "HISTORY_TEXT_2": "The first documented traces date back to the 15th century, when variants of the game were already widespread in Italian Renaissance courts.",
    "HISTORY_TEXT_3": "During the Risorgimento period, the game became a popular pastime in cafes and clubs, places of meeting and discussion.",
    "HISTORY_TEXT_4": "In 1924, with the founding of the Italian Checkers Federation (FID), the game acquired standardized rules and official recognition.",
    "BOARD_TITLE": "The Board",
    "BOARD_TEXT_1": "Italian Checkers is played on a traditional 8x8 chessboard with 64 squares, using only the 32 dark squares.",
    "BOARD_TEXT_2": "At the beginning of the game, each player arranges their 12 pieces on the dark squares of the first three rows in front of them.",
    "MOVEMENT_TITLE": "Movement and Capture",
    "MOVEMENT_TEXT_1": "Pieces move diagonally forward one square at a time. They cannot move backward until they become kings.",
    "MOVEMENT_TEXT_2": "Capture occurs by jumping over an opponent's piece to an empty square. The jumped piece is removed from the game.",
    "MOVEMENT_TEXT_3": "If after a capture it is possible to make further captures, the player must continue the sequence with the same piece until no further captures are possible.",
    "MOVEMENT_TEXT_4": "When multiple capture sequences are possible, it is mandatory to choose the one that captures the greatest number of pieces. In case of a tie, the sequence that captures more kings must be preferred.",
    "KINGS_TITLE": "The Kings",
    "KINGS_TEXT_1": "A piece becomes a king when it reaches the last row of the opponent's side of the board. It is marked by doubling the piece.",
    "KINGS_TEXT_2": "Unlike the international variant, in Italian Checkers a king can move only one square diagonally in any direction (forward or backward).",
    "KINGS_TEXT_3": "A king captures like a normal piece, moving only one square beyond the captured piece, but it can do so in all diagonal directions."
  }
}